"""
while 条件：
    条件满足时，做的事情 1
    条件满足时，做的事情 2
    条件满足时，做的事情 3
    .......
只要条件满足，会无限循环执行 ，满足条件 执行 做完后再次判断条件 满足条件 执行。。。
条件产出布尔类型 True表示继续循环 False表示结束循环
空格缩进和if语句一样
规划好终止条件，否则将无限循环
"""
# 打印10次奥里给
# i = 0                     # 循环控制因子
# while i < 10:           #  条件判断
#     print("奥里给")
#     i += 1              # 因子更新（若没有会无限循环）

# 打印10次奥里给
# 基础循环，缺少控制，所以会导致无限执行。
# while True:
#     print("奥里给")

# 控制循环在有限次数内执行，有3个要素
# 1，循环控制因子（某个变量）
# 循环控制条件（基于因子做判断）
# 循环因子更新（修改因子的值）

# 控制因子（默认为0）
num = 0

# 控制条件（基于因子）
while num < 10:
    print("第%d次：奥里给" % num + 1)

# 因子更新
    num += 1
