"""
循环内套循环
while 条件：
    条件 1 满足时，做的事情 1
    条件 1 满足时，做的事情 2
    条件 1 满足时，做的事情 3
    ........
    while 条件2：
        条件 2 满足时，做的事情 1
        条件 2 满足时，做的事情 2
        条件 2 满足时，做的事情 3
        .......
"""
# 表白100天，每天都会送10朵玫瑰花，说一句我喜欢你
# 跟判断语句的嵌套一样，循环语句的嵌套，要注意空格缩进。基于空格缩进来决定层次关系
# 注意条件的设置，避免出现无限循环。
# 循环条件的控制，层次越多越复杂，需要细心＋耐心，一层循环一份三要素，两层循环两份三要素（避免超过三层嵌套，需思考流程）
day = 1                     # 外层控制因子
while day <= 100:           # 基于因子的判断条件
    print(f"今天是第{day}天，我准备给小美表白......")
    counter = 1             # 内层控制因子
    while (counter <= 10):  # 基于因子的控制条件
        print(f"这是送给小美的第{counter}朵玫瑰花。")
        counter += 1        # 内层循环控制因子更新
    print("小美，我喜欢你")
    day += 1                # 外出循环控制因子更新
print(f"坚持到第{day - 1}天，告白成功。")
