"""
while和 for 循环两者完成的功能基本差不多：
while 循环的循环条件是自定义的，自行控制循环条件。（条件满足执行操作，条件满足执行操作，条件不满足立马结束。三要素控制）
for循环 是一种 “ 轮询（遍历） ” 机制 ：是对一批内容进行 “ 逐个处理 ”。（对一份数据集挨个取出来，那拿第一个操作，再拿第二个操作，有下一个就继续）
while循环可以无限循环，for循环除非是无限大的数据集（实际上不可能），否则实际上不能无限循环。
for 循环就是将 “代办事项 ” 逐个完成的循环机制

for循环语法：
for 临时变量 in 待处理数据集：
    循环满足条件时执行的代码
"""
# for循环语句 遍历字符串(字符串可以挨个取出来的)
# 定义字符串name
name = 'zhugedalu8888你好'        # 字符串可以被for循环使用，并且被逐个取出
for c in name:                   # 把name中的元素zhugedalu8888你好都取出来赋值给c然后执行下面的代码
    print(c)
    print("aaa")                 # 不用临时变量，被当成15次循环
# print自带换行
# 可以看出，for循环是将字符串的内容：依次取出，所以，for循环也被称之为：遍历（轮询）循环
# for循环需要注意的点：
# 1. 无法定义循环条件，只能被动取出数据处理
# 2.循环内的语句，需要有空格缩进