"""
数据类型的转换
常见的转换语句：
int(x) 将x转换为一个整数
float(x) 将x转换为一个浮点数
str(x)  将对象x转换为字符串
同前面的type()语句一样，这三个语句，都是带有结果的（返回值）
我们可以用print直接输出，或用变量存储结果值。
"""

print(int("111"))
age = int("23")
print(age)

# 数字转字符串
print("-----------------------------------")
print(str(111))  # 注意：直接打印出来字符串是不带双引号的，看不出来是不是字符串
t1 = str(111)
print(type(t1))
t2 = str(19.01)
print(type(t2))

# 整数和浮点数互转
print("-----------------------------------------")
print(float(123)) # 整数转浮点数，一切正常不会丢失精度。
print(int(123.7)) # 浮点数转整数，会丢失精确度，直接把小数部分去掉，没有四舍五入。

# 字符串转成数字
print("--------------------------------------------")
t3 = int("123")
t4 = float("1234.8")
print(type(t3))
print(type(t4))

#错误示例
# print(int("hahah")) 字符串内必须全部是数字才能转换为数字类型