
# 应用加法
print("5 + 2 = ", 5 + 2)

# 应用减法
print("5 - 2 = ", 5 - 2)

# 应用乘法
print("5 * 2 = ", 5 * 2)

# 应用除法
print("6 / 2 = ", 6 / 2) # 默认非整除算成float

# 取整除
print("5 // 2 = ", 5 // 2)

# 应用取余
print("5 % 2 = ", 5 % 2)

# 应用指数计算
print("5 ** 2 = ", 5 ** 2)

# 赋值运算符：表示将右侧的结果赋值给左侧的变量。 =
# 即执行上：先执行右侧得到结果，再赋值给左侧变量。
print("-----------------------------------------")
age = 10
age = age + 5
print(age)

# 复合赋值运算符
# 基础架构：？=
# a ?= b 表示a ? b 再赋值给c 即： a = a ? b
# ?可以是任何的算数运算符，如上：
# c+=a 代表c+a再赋值给c
print("-------------------------")
num = 10
num += 1  # 相当于num = num + 1
print(age)
age1 = 100
age1 -= 5
print(age1)
age2 = 100
age2 *= 10
print(age2)

