# 引号嵌套
# 双引号写法  建议，所有编程语言都是这样写的
name = "诸葛孔明"

# 单引号写法(为了避免过多的转义)
name = '周瑜'

# 有个字符串是："太古里"
# address = ""太古里""  就近匹配 双引号和最近的双引号匹配后，只剩太古里，报错。
address = '"太古里"'
print(address)
# 有个字符串是：'太古里'
address2 = "'太古里'"
print(address2)

# 三引号写法
# 如果没有变量接收，作为多行注释存在。
# 如果有变量接收值，就是字符串。
# 复制大量文本可以使用
info = """我叫诸葛亮"""
print(info)
info1 = """我年纪撒比就开始"查看的"是不成'熟'考虑时间"""
print(info1)

# 扩展 转义字符 （\）   转义：转换含义
# 某些字符有特殊功能，如" 2个成对表示字符串  " 有特殊功能
# 转义字符的作用：
# 1. 有特殊功能，被转义字符转义后，无特殊功能。
# 2. 没有特殊功能，被转义字符后，有特殊功能。
print("--------------------------------------------------")
address3 = "\"人工智能\""  # 将特殊功能取消
address4 = "\'人工智能\'"
address5 = "\'人工n智能\'"  # n无特殊功能
address6 = "\'人工\n智能\'"  # 给n提供特殊功能：n无特殊功能  \n变成有特殊功能，即换行（newline）。
print(address3)
print(address4)
print(address5)
print(address6)

