"""
使用 m.n 来控制数据的宽度和精度
 1. m 控制宽度 要求是数字 设置的宽度小于数字自身不生效
    比如：123  设置5的话 会变成： [空格][空格]123  123前面还有两个空格 宽度共为5
         设置为2的话 小于数字自身宽度不生效
2. .n 控制小数点精度，要求是数字，会进行小数的四舍五入
   比如：%5d 表示将整数的宽度控制在5位。如数字11 会变成:[空格][空格][空格]11 用三个空格补足宽度。
        %5.2f 表示将宽度控制在5位（小数点和小数部分也算入宽度），将小数点精度设置为2，且进行小数点的四舍五入。
              数字11.345 设置为%7.2f后 变成 : [空格][空格]11.35
        %.2f 表示不限制宽度，只设置小数点精度为2，如11.345设置为%.2f后 变成11.35
"""

age = 11
height = 185.567

# 此时表示占位的是数字且占用了5个宽度等待填充
print("年龄为%5d岁" % age)

# 占用的宽度小于数字实际的宽度，不生效
print("年龄为%1d岁" % age)

# 整数 对.n即小数点控制 不生效
print("年龄为%3.2d岁" % age)

# 用整数接收小数 小数部分丢失 .n控制不生效 m控制生效
print("身高为%3.2dcm" % height)
print("-"*100)

print("身高%7.2fcm" % height)

# 对于浮点数，m如果设置小于真实总宽度，同样不生效
print("身高%5.2fcm" % height)

# 如果不需要总宽度控制，可以不写m，如下 .1f 表示小数点限制一位，总宽度不限制
print("身高%.2fcm" % height)

print("身高%.1fcm" % height)

# 宽度控制场景：对齐
print("-"*100)
print("年龄：%6d岁" % age)
print("身高：%6.2fcm" % height)
print("-"*100)
print("您的余额：%5d 元" % 100)
print("您的余额：%5d 元" % 1000)
print("您的余额：%5d 元" % 10000)


