"""
这是一个表达式格式化的演示文件
"""
# 表达式：一条具有明确执行结果的代码语句（！！！有结果的代码就是表达式）
# 如： 1 + 1  、5 * 2 ，就是表达式，因为有具体的结果，结果是一个数字
# 又或者，常见的变量定义： name = "张三"  age = 11 + 11

age = 11 * 2 / 3 + 5  # 右侧就是表达式，给出具体结果赋予左侧变量
name = "小" + "明"     # 右侧也是表达式因为有结果为："小明"
info = "字符串在python中的的类型是：%s" % type("字符串")  # 右侧是表达式，产生具体的字符串作为结果

# 字符串格式化中，不仅仅可以格式化变量、字面量、其实任意表达式都可以。
print("小明的年龄是：%s" % (2+3*age))
print("数字类型在python中的类型是：%s" % type(1))
print(f"小明的年龄是{3*3+age}，喜好是{'游泳'}")
# 表达式格式化
print(" 2 * 3 的结果是:%d" % (2 * 3))
print( f" 2 * 3 的结果是:{2*3}")
print("字符串在python中的类型是：%s" % type("字符串"))  #type会产生结果，是表达式