"""
如何从列表中取出特定位置的数据呢？
我们可以使用：下标索引
每一个子元素都有自己的序号（下标索引），从前向后的方向，从0开始，依次递增.....
我们只需要按照下标索引，即可取得对应位置的元素
"""
# 语法: 列表[下标索引值]
name_list = ["诸葛亮","刘备","关羽","曹操"]
print(name_list[0])             # 取出第一个元素，下标是0
print(name_list[1])
print(name_list[2])
print(name_list[3])
print(name_list[-0]) # -0就是0

# 列表的反向索引，也就是从后向前：从-1开始，依次递减-1、-2、-3、-4.....
print("-"*10 + "列表的反向索引" + "-"*10)
lst = [1,2,3,4,5,67,8,9,101,11,12,13,34,24,56,66,777,88]
print(lst[-2])

"""
列表的下标：
[ 1, 2, 3, 4, 5, 6, 7]
  0  1  2  3  4  5  6          # 列表的下标  正向下标
 -7 -6 -5 -4 -3 -2 -1          # 反向下标
"""

# 嵌套列表的下标（索引），同样支持下标索引(正向、反向)
big_list = [[1,2,3],[7,8,9]]
print(big_list[0][2])
print(big_list[-1][-1])
print(big_list[-1][0])

# 多层嵌套建议换行
print("-"*10 + "多层嵌套" + "-"*10)
lst1 = [
    [
        [1,2,3],
        [4,5,6]
    ],
    [
        [7,8,9],
        [11,12,13]
    ],
    [
        [3,9,18],
        [20,21,30]
    ]
    ]
print(lst1[0][0][0])
print(lst1[0][0][2])

"""
列表的下标索引是什么？
列表的每一个元素，都有编号称之为下标索引
列表[下标]即可取出
"""