"""
列表的常用操作（方法）
列表除了可以：
 定义
 使用下标索引获取值
以外，也提供了一系列功能：
 插入元素
 删除元素
 清空列表
 修改元素
 统计元素个数
等等功能，这些功能我们都称之为  ：列表的方法
列表的查询功能（方法）
回忆：函数是一个封装的代码单元，可以提供特定功能。
在Python中，如果将函数定义为Class（类）的成员，那么函数会称之为：方法。
单独定义函数就叫```函数```，函数放在Class类里面就叫做```方法```
方法和函数功能一样，有传入函数，有返回值，只是方法的使用格式不同：
函数的使用：num = add(1,2)
方法的使用：student = Student()
          num = student.add(1,2)
"""
# 列表本质上是一个类，内部提供了很多内置函数（称之为方法），这些内置函数（方法）的使用，在语法上比较特殊需要写为：列表变量.内置函数()
# 1.列表的查询功能（方法）
# 查询某元素的下标
# 功能：查找指定元素在列表的下标，如果找不到，则报错ValueError
# 语法：列表对象.index(元素)
# index就是列表对象（变量）内置的方法（函数）
lst1 = ["好好","嗯嗯","哈哈","哦哦"]
print(lst1.index("嗯嗯"))             # 查找元素是否在列表中：列表变量.index(被查找的数据)  找到了返回下标值

# 快捷操作:确定某个元素是否在列表内，找不到下标
# 元素 in 列表变量
# 在里面给True  不在里面给False
print("666" in lst1)

# 2.列表的修改功能（方法）
# 修改特定位置（索引）的元素值(修改指定下标的元素值)
# 语法：列表变量[下标] = 值
# 可以使用如上语法，直接对指定下标（正向、反向下标即可）的值进行：重新赋值（修改）
lst2 = [2,5,87,4]
lst2[2] = 7
print(lst2)
lst2[-3] = 9
print(lst2)


# 3.在列表指定下标位置，插入新元素（在指定位置插入一个）
# 语法：列表变量.insert(下标，元素)，在指定的下标位置，插入指定的元素
# 当下标值超出列表的索引范围，相当于在尾部新增一个元素
lst3 = ["哦好啊","好好好"]
lst3.insert(1,"好的")
lst3.insert(10,"的的")            # 超出范围，直接在后面紧贴插入，相当于在尾部新增一个
print(lst3)

# 4.追加元素(在尾部加一个元素)
# 语法：列表变量.append(元素)，将指定元素，追加到列表的尾部
lst4 = [1,25,2,6,7 ]
lst4.append(8)
print(lst4)
lst4.append([7,8,9,10])
print(lst4)

# 5.追加元素方式2（在列表尾部新增一批元素，将其它数据容器追加到当前列表尾部）
# 语法：列表变量.extend(其它数据容器)，将其它数据容器的内容取出，依次追加到列表尾部。
lst5 = [1,2,3,4,5]
lst5.extend([7,8,9,10])
print(lst5)

# 6.删除元素
# 语法1：del列表变量[下标]
lst6 = [7,6,9,25]
del lst6[0]
print(lst6)
# 语法2：列表.pop(下标)
# 和语法1的区别是：pop有返回值，返回的是：被删除的元素
deleted_data = lst6.pop(2)
print(f"被删除的是：{deleted_data}")
print("被删除的是：",deleted_data)

print(lst6)

# 7.删除某元素在列表中的```第一个```匹配项(删除不存在的会报错)
# 语法：列表变量.remove(元素)
lst7 = [1,4,3]
lst7.remove(4)
print(lst7)

# 8.清空列表内容
# 语法：列表.clear()
lst8 = [1,4,5]
lst8.clear()
print(lst8)
# 方式2
lst8 = [1,4,5]
lst8 = []
print(lst8)


# 9.统计某元素在列表内的数量(统计不存在的就是0)
# 语法：列表变量.count(元素)
lst9 = [1,1,4,5,7]
print(lst9.count(1))

# 10.统计列表总共有多少元素
# 语法: len(列表)
lst10 = [1,2,43,65,8,89,1,4,4,56,4,5,]
print(len(lst10))


"""
总结列表特定：
 1.列表上限：2^63 - 1
 2.可以容纳不同类型的元素（混装）
 3，数据是有序存储的（有下标序号,有下标代表有序）
 4.允许重复数据存在
 5.可以修改、增加、删除元素
"""