"""
对比while循环，for循环更加适合对列表等数据容器进行遍历
语法：
for 临时变量 in 数据容器（可迭代对象）：
    对临时变量进行处理

表示，从容器内，依次取出元素并赋值到临时变量上
在每一次循环中，我们可以对临时变量进行处理
"""
lst = [1,5,67,89,34,57767,78,9,34,54578,467,223,22,23,57]
for i in lst:
    print(i)


"""
while循环和for循环，都是循环语句，但细节不同：
 1. 在循环控制上：
    while循环可以自定循环条件，并自行控制。
    for循环不可以自定循环条件，只可以从一个容器内取出数据。
 2. 在无限循环上：
    while循环可以通过条件控制做到无限循环。
    for循环理论上不可以，因为被遍历的容器容量不是无限的。
 3. 在使用场景上：
    while循环适用于任何想要循环的场景。
    for循环适用于，```遍历数据容器的场景```或```简单的固定次数循环场景```
for循环更简单，while更灵活 
"""