"""
为什么需要元组tuple？
如果想要传递的信息，不被篡改，列表就不合适了
元组同列表一样，都是可以封装多个、不同类型的元素在内。
但最大的不同点在于：
元组一旦定义完成，就不可修改
所以，当我们需要在程序内封装数据，又不希望封装的数据被篡改，那么元组就非常适合了。
"""
# 定义元组：定义元组使用```小括号```，且使用逗号隔开各个数据，数据可以是不同的数据类型
# 定义元组字面量
# (元素,元素,元素,.....)
# 定义元组变量
# 变量名称 = (元素,元素,元素,.....)
# 定义空元组
# 变量名称 = ()         # 方式1
# 变量名称 =  tuple()   # 方式2

# 定义3个元素的元组
t1 = (1,"hello",True)
print(t1,"的类型是：",type(t1))

# 得到空元组
t1 = ()
t2 = tuple()
print(type(t1),type(t2))

# 定义1个元素的元组```特殊写法```（注意：元组只有一个数据，这个数据后面要添加逗号）
t3 = ("hello",)             # 注意：必须带有逗号，否则不是元组类型
print(type(t3))

# 元组也支持嵌套
# 定义一个嵌套元组
# 元组也有下标，可以通过[下标]取值
t1 = ((1,23),(1,3,5))
print(t1[0][1])
# t1[0][0] = 2
# print(t1[0][0])
