# 根据下标（索引）取出数据
t1 = (1,2,"hello")
print(t1[2])

# 根据index()，查找特定元素的第一个匹配项   和list一样
t1 = (1,2,"hello")
print(t1.index("hello"))

# 根据count(),统计某个数据在元组内出现的次数 和list一样
t1 = (1,2,"hello",1,56,89,1,2,3,41,1,1325,667,8)
print(t1.count(1))

# 统计元组内的元素个数 len(元组)
t1 = (1,2,"hello",1,56,89,1,2,3,41,1,1325,667,8)
print(len(t1))


# 注意事项
# 1. 不可以修改元组的内容，否则会直接报错。
# 2.可以修改元组内的list的内容（修改元素、增加、删除、反转等），注意是内容
# 可以修改元组内部的list的内部值
t1 = (1,4,5,7,8,12,45,["哈哈","呜呜","嗯哼"])
t1[7][0] = "┭┮﹏┭┮"          # 对元组内元素内的list的某个元素进行重新赋值
print(t1)
t1[7].append(10000)
print(t1)

# 这是对元组元素的重新赋值为新list，不支持
# t1[7] = [1,23,45,6]           # 相当于改元组对象，不可以改


lst = [1,2,3]               # lst变量的内存是全部数据
t1 = (1,2,[1,2,3])          # t1元组变量的数据存储是1,2,指针（内存地址，内存的某个区域），即元组内并没有单独在内存中存放列表的全部数据，
                            # 而是存了一个指针，指向列表的内存区域。
# t1[2] = [1,23,45,6]       # [1,23,45,6]是一块新的内存区域，相当于改指针地址，把元组改了
# 在元组中，对list的值进行修改新增，不会影响指针的值，只是指针指向的内存区域的内容有变化。但是要修改这个指针为其他值，则不行。


