"""
序列是指：内容连续，有序，可使用下标索引的一类数据容器。
列表、元组、字符串，均可视为序列。
元素1 元素2 元素3 元素4 元素5 .... 元素n
  0    1     2    3    4   ....   n-1

序列支持切片，即：元组、列表、字符串均支持切片操作。
切片：从一个序列中，取出一个子序列。
语法：```序列[起始下标：结束下标:步长]```
表示从序列中，从指定位置中，依次取出元素，到指定位置结束，得到一个新序列：
1. 起始下标表示从何处开始，可以留空，留空表示从头开始。
2. 结束下标（包头不包尾）表示何处结束，可以留空，表示截取到结尾。
3. 步长表示，依次取元素的间隔。
    步长1表示，一个一个取元素
    步长2表示，每次跳过一个取元素
    步长n表示，每次跳过n-1个元素取
    步长为负数表示，反向取（注意，起始下标和结束下标也要反向标记）
注意:此操作不会影响序列本身，而是会得到一个新的序列（列表、元组、字符串）
"""
lst = [1,2,3,5,6,78,45]
lst1 = lst[1:4]     # 下标1开始，下标4结束（不含下标），步长为1
print(lst1)

lst = [1,2,3,5,6,78,45]
lst1 = lst[::2]
lst2 = lst[::]    # 步长不写默认为1
print(lst1)
print(lst2)

my_str = "dhjsjcjd"
nwe_str =  my_str[:4:2]
print(nwe_str)

my_str = "12345"
nwe_str =  my_str[::-1]         # 负数表示反着取，从尾巴开始，开头结束，步长为1
print(nwe_str)

lst = [1,2,3,4,5]
lst3 = lst[3:1:-1]          # 从下标3开始，1结束（不含），就是3、4 -1代表反着取，所以是[4,3]
print(lst3)

lst = [1,2,3,4,5]
lst3 = lst[:1:-2]          # 从下标3开始，1结束（不含），就是3、4 -1代表反着取，所以是[4,3]
print(lst3)

lst =["aa","bb",3,5,6]
# 取出来5、3、"bb"
print(lst[-2:-5:-1])
print(lst[3:0:-1])

lst =[1,2,4,6,8,4,32,5,78,58,23,423]
# 取出23、5、8
print(lst[-2:3:-3])

name = "ahjas akjs akjsnd"
# 反转字符串
print(name[::-1])

"""
序列都可以切片（序列就是有下标的）：
字符串
元组
列表

"""