"""
字典的定义：
同样使用{},不过存储的元素是一个个的：键值对(kv对)，如下语法：
    1. 定义字典字面量
    # 使用{}存储原始，每一个元素都是一个键值对
    # key和value可以是任意类型的数据（key不可为数据容器，value可以是数据容器）
    # key不可重复，重复会对原有数据覆盖
    {key:value,key:value,....,key:value}    # 对比生活中的字典 字（key）：含义（value）
    2. 定义字典变量
    my_dict = {key:value,key:value,....,key:value}
    3. 定义空字典
    my_dict = {}            # 定义空字典方式 1
    my_dict = dict()        # 定义空字典方式 2


"""

# 空字典
d = {}
print(type(d))
d = dict()
print(type(d))      # 打印结果：<class 'dict'>


# 字典同集合一样，不可以使用下标索引
# 但是字典可以通过key值来获取对应的value
# 访问元素的语法： 字典变量[key]  注意[]里面不是下标，而是key的值

stu_score = {"张三":90,"李四":78,"王麻子":89}
# print(stu_score[0])      # stu_score[0]本质上是找0这个下标，而不是找0这个下标
print(stu_score["张三"])

# 字典的key不可以重复
stu_score = {"张三":90,"李四":78,"王麻子":89,"张三":98}
# 打印出来后，后面的数据会覆盖前面的数据
print(stu_score)
print(stu_score["张三"])

# 字典可以嵌套
# key一般是字符串或整数
# value任意
print("-" * 10 + "字典的嵌套" + "-" * 10)
test_info = {
    "张三":{
        "语文":77,
        "数学":66,
        "英语":33
    },
    "李四":{
        "语文":88,
        "数学":86,
        "英语":55
    },
    "王麻子":{
        "语文":96,
        "数学":99,
        "英语":90
    }
}
print(test_info["王麻子"])
print(test_info["王麻子"]["数学"])

# 记录每一个学生的爱好
stu_hobby = {
    "张三":["唱","跳","rap"],
    "李四":["吃","喝","拉"],
    "王麻子":["看书","健身","美女"]
}
# 查看爱好
print(stu_hobby["李四"])
# 查看爱好2
print(stu_hobby["李四"][1])

"""
为什么使用字典？
字典可以提供基于key检索value的场景实现
就像查字典一样
"""
