d = {
    "张三" : { "语文":77,"数学":66, "英语":33},
    "李四" : {"语文":88,"数学":86,"英语":55},
    "王麻子" : { "语文":96,"数学":99,"英语":90}
}

# 1. ```新增元素```
d["王五"] = {"语文":87,"数学":78,"英语":99}
print(d)

# 2. ```更新元素```
d["张三"] = {"语文":67,"数学":99,"英语":90}
print(d)

# 新增和更新语法一致，当key不存在时，为新增。当key存在时，为修改。

# 3. 删除某个key,并将其对应的value作为返回值提供
delete_key = d.pop("王麻子")
print(d)
print(delete_key)

# 4. 清空
# 方式 1
d.clear()
print(d)
# 方式 2
d = {
    "张三" : { "语文":77,"数学":66, "英语":33},
    "李四" : {"语文":88,"数学":86,"英语":55},
    "王麻子" : { "语文":96,"数学":99,"英语":90}
}
d = {}
print(d)

# 5. 得到全部的key
d = {
    "张三" : { "语文":77,"数学":66, "英语":33},
    "李四" : {"语文":88,"数学":86,"英语":55},
    "王麻子" : { "语文":96,"数学":99,"英语":90}
}
print(d.keys())         # 结果：dict_keys(['张三', '李四', '王麻子'])
# 字典.keys()的结果可以被遍历

# 6. 遍历字典
# 遍历字典方式1、
# 可读性好
for key in d.keys():
    # print(key)
    print(f"{key}:{d[key]}")

# 遍历字典方式 2
# 直接对字典做 for x in 字典,得到的就是key
for key in d:
    print(f"{key}:{d[key]}")

# 7.得到字典长度(有多少个键值对）
print(len(d))

"""
总结字典特点：
1. 可以容纳多个数据
2. 可以容纳不同类型的数据
3. 每一份数据是KV键值对
4. 可以通过key获取到value，key不可重复（重复会被覆盖）
5. 不支持下标索引
6. 可以修改（增加或删除更新元素等）
7. 支持for循环，不支持while循环
"""

