# ------------------------------ 列表 List案例 --------------------------------------
# 案例1：将用户输入的10个数字，存储到一个列表中，并将列表中的数字进行排序，输出其中的最小值、最大值和平均值。


# 1. 定义列表
num_list = []

# 2. 将用户输入的数字存入到列表
for i in range(10):
    num = int(input("请输入一个有效数字："))      # 一直要让用户输入数字，重复性操作，可以用循环
    num_list.append(num)                       # 列表.append() 在尾部加入元素
print("输入的数字列表为：",num_list)

# 3. 对数字进行排序   ---->  sort() 排序 从小到大排序
num_list.sort()
print("更新后的数字列表为：",num_list)

# 4. 输出其中的最小值、最大值和平均值  -----> sum(列表) 对列表所有的元素累加求和     len(列表) 获取列表元素个数（长度）
print("数字列表的最小值为：",num_list[0])
print("数字列表的最大值为：",num_list[-1])
print("数字列表的平均为值为：",sum(num_list)/len(num_list))