#  ------------------------------ 列表 List案例 2  --------------------------------------
#  合并两个列表中的元素，并对合并的结果进行去重处理（去除列表中的重复元素）
#
#  1.合并列表
#  方式1
# lst1 = [1,2,3,56,8,58,4,34,4]
# lst2 = [3,78,9,3,56,4,23,567,567]
# for num in lst2:
#     lst1.append(num)
# print("合并后的原始列表：",lst1)
#
#
# # 去除重复记录
# new_list = []           # 去除重复记录后的列表
# for num in lst1:
#     # 判断 new_list里面是否存在num元素，如果不存在，再添加
#     if num not in new_list:     # 判断元素是否存在于列表中，如果存在则返回True（布尔值）
#         new_list.append(num)
# print("去除重复元素后的列表：",new_list)


# # ------------------------------ 列表 List案例 2（简化版本）  --------------------------------------
# # 合并两个列表中的元素，并对合并的结果进行去重处理（去除列表中的重复元素）
#
# # 1.合并列表
# # 方式 1 （循环耗费性能）
# # 方式 2
# # 解包：将列表这一类容器解开成一个一个独立的元素  语法：[*列表]
# # 组包：将多个值合并到一个容器
# lst1 = [1,2,3,56,8,58,4,34,4]
# lst2 = [3,78,9,3,56,4,23,567,567]
# lst3 = [*lst1,*lst2]
# print("合并后的原始列表：",lst3)
#
#
# # 去除重复记录
# new_list = []           # 去除重复记录后的列表
# for num in lst3:
#     # 判断 new_list里面是否存在num元素，如果不存在，再添加
#     if num not in new_list:     # 判断元素是否存在于列表中，如果存在则返回True（布尔值）
#         new_list.append(num)
# print("去除重复元素后的列表：",new_list)
# # 判断一个元素是否存在于列表之中？ ---->  语法：元素 in 列表  ----->  结果返回布尔值（True表示存在）

# ------------------------------ 列表 List案例 2  --------------------------------------
# 合并两个列表中的元素，并对合并的结果进行去重处理（去除列表中的重复元素）

# 1.合并列表
# 方式1
lst1 = [1,2,3,56,8,58,4,34,4]
lst2 = [3,78,9,3,56,4,23,567,567]
lst3 = lst1 + lst2
print("合并后的原始列表：",lst3)


# 去除重复记录
new_list = []           # 去除重复记录后的列表
for num in lst3:
    # 判断 new_list里面是否存在num元素，如果不存在，再添加
    if num not in new_list:     # 判断元素是否存在于列表中，如果存在则返回True（布尔值）
        new_list.append(num)
print("去除重复元素后的列表：",new_list)

"""
总结：
1. 如何快速合并两个列表？
   遍历 ----> 添加
   解包
    +
2.判断一个元素是否存在于列表之中？ 
  语法：元素 in 列表  ----->  结果返回布尔值（True表示存在）

"""