# 1.将多个列表合并为一个列表，并去重重复元素，排好序（升序）输出到控制台
# 解包合并列表
list1 = [1,2,5,7,1,3,56,446,577,63,5,78,91,3,4]
list2 = [2,43,6,8,91,2,23,5,6,78,3,4,4]
list3 = [3,6,8,912,4,5,7,81,2,3,4]
list4 =[*list1,*list2,*list3]
print("合并后的原始列表：",list4)
# 去重重复元素
list5 = []
for i in list4:
    if i not in list5:
        list5.append(i)
print("去重重复元素后的列表：",list5)

# 将如下能被 3 或 5 整除的元素提出来，并获取这些数字对应的平方，组成一个新的列表。
list1 = [1,2,3,34,6,7,8,99,1,232,56,90,5,25,30]
list2 = [ i**2 for i in list1 if i%3==0 or i%5 == 0]
print(list2)

# 将如下列表中的整数提取出来，封装成一个新的列表。
list1= [1,2,-2,-1,-89,-45,1,2,6,7,2]
list2 = [i for i in list1 if i > 0]
print(list2)

