# 逻辑判断就是对条件进行判断
# 判断是程序最基础最核心的逻辑功能
# 布尔类型用于表示：真和假（底层是数字）
# 比较运算符用于计算：真和假
# 进行判断只有两种结果：是（1）和否（0）
# 程序中描述是或否的：布尔类型
# 布尔表示现实生活中的逻辑，即真和假：True表示真、False表示假。True本质上是一个数字记作1，False记作0
# 定义变量存储布尔类型数据： 变量名称 = 布尔类型字面量
# 布尔类型不仅可以自定义，同时也可以通过计算得到。也就是使用比较运算符进行比较运算得到布尔类型的结果。
# 比较运算符
# == 判断内容是否相等 满足为True，不满足为False
# ！= 判断内容是否不相等 满足为True，不满足为False
# > >= < <=

# bool类型本身，2个字面量
t1 = True      #真
t2 = False     #假

print(type(t1),type(t2))
print("-"*50,"==判断")
# 可以通过比较运算符得到布尔结果
# == 相等判断   1个=是赋值 2个=是比较
print("text等于test吗？结果为：%s" % ("test" == "text"))
print("5 等于 5.0 吗？结果为：%s" % ( 5  == 5.0))
print("'5' 等于 '5.0' 吗？结果为：%s" % ( '5'  == '5.0'))
print("-"*50,"!=判断")

# ！= 不相等判断
print("text不等于test吗？结果为：%s" % ("test" != "text"))
print("5 不等于 5.0 吗？结果为：%s" % ( 5  != 5.0))
print("'5' 不等于 '5.0' 吗？结果为：%s" % ( '5'  != '5.0'))

# > >= < <=
print("-"*50)
print("5 > 5 ? = %s" % ( 5 > 5))
print("5 >= 5 ? = %s" % ( 5 >= 5))
print("4 <= 5 ? = %s" % ( 4 <= 5))
print("4 < 5 ? = %s" % ( 4 < 5))

# 字符串比较
"""
字符串比较是按位比较，第一位和对方第一位比较，出结果后续不比了，没有则继续向后比。
条件：
"1" < "2"
"a" < "b"
"A" < "B"
"A" < "a"   大写字母小于小写字母 
无内容 < 有内容  比如： a 和 aa 大的是 aa

速记： 全部小写字母 > 全部大写字母 > 全部数字

"12"  >  "11"  True
"12"  >  "123"  False

非中文字符的详细比较关系 需要参考ASCII码表
中文字符的详细比较关系，需要参考UTF8编码表  
"""
print("-"*50)
print("'12' > '5' 吗？ = %s" % ('12' > '5'))
print('"你" > "我" 吗？ = %s' % ("你" > "我"))


print("-"*50)
result = 10 > 1
print(f"10 > 1 的结果是：{result},类型是：{type(result)}")

result = "test" == "text"
print(f"字符串'test'和'text'是否相等，结果是：{result}，类型是：{type(result)}")