"""
  某些场景下，判断条件不止一个，可能有多个。
  这种需求能用python实现吗？
  if elif else 可以实现
  语法结构：
  if 条件1：
      条件 1 满足应做的事情
      条件 1 满足应做的事情
  elif 条件2：
      条件 2 满足应做的事情
      条件 2 满足应做的事情
  elif 条件N：
      条件 N 满足应做的事情
      条件 N 满足应做的事情
      .......
  else:
      所有条件都不满足应做的事情
      所有条件都不满足应做的事情
      .......
if和elif是或者的关系，满足一个就执行
 判断是互斥且有顺序的，满足条件1将不会理会2和3，满足2将不会理会3，都不满足进入else
"""
from ipaddress import v4_int_to_packed

# print("欢迎来到天堂游乐园！")
# height = float(input("请输入您的身高（cm）："))
# vip_level = int(input("请输入您的VIP等级:"))
# date = int(input("今天是几号？："))
# # 身高小于120cm 或者 vip等级大于等于3 或者 日期为1号 免费 否则 需购票10元。
# if height <= 120:   # 三个条件互斥，哪怕vip和日期满足，只要身高满足，后面的条件23都不会执行
#     print("您的身高小于120cm，可以免费游玩。")
# elif vip_level >= 3:             # elif可以写多个
#     print("您的VIP等级大于3，可以免费游玩。")
# elif date == 1:
#     print("今天是1号，可以免费游玩。")
# else:
#     print("不好意思，所有的条件都不满足，需要购票100元。")
# print("祝您玩得愉快！")


# 编程套路 感受和上面代码的区别 将input语句直接输入判断条件中，节省代码量，一个一个来判断
if int(input("请输入您的身高（cm）：")) <= 120:
    print("您的身高小于120cm，可以免费游玩。")
elif int(input("请输入您的vip等级（1-5）：")) >= 3:
    print("您的vip等级大于3，可以免费游玩。")
elif int(input("请输入今天的日期：")) == 1:
    print("今天是1号，可以免费游玩。")
else:
    print("所有的条件你不满足，请购票100元。")
print("祝游玩愉快！")
