"""
很多场景，不仅仅是多个并列条件，还会有满足前置条件才会二次判断的多层判断需求
对于这种需求，嵌套判断语句可以实现
"""
# 基础语法格式如下
#  if 条件1：
#       满足条件1  做的事情1
#       满足条件1  做的事情2
#       if 条件2：
#           满足条件2 做的事情1
#           满足条件2 做的事情2
# 第二个if属于第一个if内，只有第一个if满足为真，才会执行第二个if。
# 嵌套的关键点：空格缩进（决定语句之间的层次关系） 同级的if和else就近配对
# print("欢迎来到天堂游乐园")
# if float(input("请输入您的身高（cm）：")) >= 120:
#     print("不好意思，您的身高大于120cm，不可以免费游玩。")
#     print("不过您的VIP等级大于3，可以免费游玩。")
#     if int(input("请输入您的VIP等级(1-10)：")) > 3:
#         print("您的VIP等级大于3，可以免费游玩。")
#     else:
#         print("不好意思，您的VIP等级不符合，需要补票100元。")
# else:
#     print("您的身高小于120cm，可以免费游玩。")
# print("祝您游玩愉快。")



# # 判断语句的嵌套
# 自由组合嵌套，需求如下：
# 公司要发礼物，条件是：
# 1. 必须是大于等于18岁小于30岁的成年人
# 2. 同时入职时间需满足大于2年，或者级别大于3才可以领取。
# if 18 <= int(input("请输入您的年龄：")) < 30 :
#     print("您的年龄符合大于等于18小于30岁的成年人")
#     print("但同时还需要入职需满足大于2年或者级别大于3才可以领取。")
#     if int(input("请输入您的入职时间：")) > 2:
#         print("您的入职时间符合条件，可以领取礼物。")
#     elif int(input("请输入您的级别：")) > 3:
#         print("您的级别符合条件，可以领取礼物。")
#     else:
#         print("您的年龄满足，但入职时间或者级别不满足，不能领取礼物。")
# else:
#     print("您的年龄不满足条件，不能领取礼物。")

# 三层嵌套，三组同级 嵌套判断语句，注意空格缩进，python通过空格缩进来决定层次关系
age = int(input("请输入您的年龄："))
year = int(input("请输入您的入职时间："))
level = int(input("请输入您的级别："))
if age >= 18:
    if age < 30:
        if year >= 2:
            print("入职时间满足2年，可以领取礼物。")
        elif level > 3:
            print("级别大于3，可以领取礼物。")
        else:
            print("级别和时间都不满足，不能领取礼物。")
    else:
        print("虽然成年但是年龄超标，不能领取礼物。")
else:
    print("未成年不可以领取礼物。")
