"""
很多场景，不仅仅是多个并列条件，还会有满足前置条件才会二次判断的多层判断需求
对于这种需求，嵌套判断语句可以实现
"""
# 基础语法格式如下
#  if 条件1：
#       满足条件1  做的事情1
#       满足条件1  做的事情2
#       if 条件2：
#           满足条件2 做的事情1
#           满足条件2 做的事情2
# 第二个if属于第一个if内，只有第一个if满足为真，才会执行第二个if。
# 嵌套的关键点：空格缩进（决定语句之间的层次关系） 同级的if和else就近配对
print("欢迎来到天堂游乐园")
if float(input("请输入您的身高（cm）：")) >= 120:
    print("不好意思，您的身高大于120cm，不可以免费游玩。")
    print("不过您的VIP等级大于3，可以免费游玩。")
    if int(input("请输入您的VIP等级(1-10)：")) > 3:
        print("您的VIP等级大于3，可以免费游玩。")
    else:
        print("不好意思，您的VIP等级不符合，需要补票100元。")
else:
    print("您的身高小于120cm，可以免费游玩。")
print("祝您游玩愉快。")
