"""
函数的传入参数的功能是：在函数进行计算时，接受外部（调用时）提供的数据。
"""
# 例如:
def add():
    result = 1 + 2
    print(f"1 + 2 的结果是：{result}")
add()
print("-"*100)
# 函数的传入参数
# def 函数名（传入参数）：
#    函数体
#    return 返回值
# 可以有如下函数定义：
# 实现了，每次计算的是x + y，而非固定的1 + 2    '''计算逻辑固定，提供计算动态数据'''  多个参数逗号隔开
def add(x,y):                   # x和y是形式参数（声明），表明调用函数时，请传入2个数据，函数将传入的数据赋值给x和y
    # 调用时相当于：x = 1 , y = 1
    result = x + y
    print(f"{x} + {y} = {x + y}")
add(1,1)
add("你好","晚安")
add("你好","886")
add("你好",886)
# 参数名字说法：
"""
# 形式参数，即def add(x,y):   这个x和y是称之为形式参数(形参)
叫做形式参数是因为，它没有实体，而是一种声明（口嗨）
即'''声明'''使用该函数，请提供2个数据，2份数据会赋值给x和y

# 实际参数，即：add(100,10)  这个10和100称之为实际参数(实参)
是因为在函数的声明下，调用的时候'''真的'''传递的符合要求的数据
即参数是实际存在的。

# 传入实际参数的类型不受限制，随意传，但是能不能跑就看具体代码兼容与否

# 传入参数的数量是不限的，但对应的实参数量也要一样，也要一一对应。

"""