# 让两个字符串一起
print("诸葛亮","草船借剑")  # 合在一起有个致命缺点： 中间会加空格，避免不掉。
# 在Python种 +号用于数字是数学计算，用于字符串就是两个两个字符串拼接在一起，eg： "a" + "a" 变成aa
print("周瑜" + "打黄盖")
print("------------------------------------")
name = "项羽"
age = 5000
height = 190
# 组装信息：我是XXX，今年XXX岁，身高XXX厘米。
# print("我是" + name + "," + "今年" + age + "岁" + "," + "身高" + height + "岁。")
# info = "我是" + name + "," + "今年" + age + "岁" + "," + "身高" + height + "岁。"
# 注意：会报黄。字符串+字符串是字符串，数字+数字是数字，那么字符串+数字是什么？
# 报黄原因：只能str to str
# 所以这个地方我们需要用到类型转换
info = "我是" + name + "," + "今年" + str(age) + "岁" + "," + "身高" + str(height) + "厘米。"
print(info)

# 拓展 字符串乘以数字 可以做到将字符串复制多少份前后拼接到一起 python语法糖
print("-------------------------------")
print("哈哈"*10) # 代表输出20个哈哈